meshGenTesting/rect1Graded/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          80;
        startFace       95320;
    }
    outlet
    {
        type            patch;
        nFaces          80;
        startFace       95400;
    }
    top
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          600;
        startFace       95480;
    }
    bottom
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          600;
        startFace       96080;
    }
    defaultFaces
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          96000;
        startFace       96680;
    }
)

// ************************************************************************* //
